[
{"name": "7th Annual MCPL Rang Aur Patang Utsav 2024", "description": ["Black Hill Regional Park", "#RAPU 2024...!!!!", "Maryland Cricket Premier League proudly presents", "7th Annual MCPL Rang Aur Patang Utsav 2024", "April 21st, 2024 - 11am Onwards @ Black Hill Regional Park", "Please join us with your friends and family for this fun filled event which includes, Live Entertainment by DJ, Kids Activities, Non-Toxic Colors, Indian Kites and Manjha (without glass powder so safe for all) and lot more...!!!", "If you have young children, then do not worry because we will have tons of entertainment for our little ones!!!", "Kites, Colors and Indian Snacks will be available for purchase at reasonable price.", "Please contact us for more information, vendor inquiries and sponsorship opportunities.", "mcpl.rapu@gmail.com", "NO OUTSIDE FOOD, DRINK, KITES, STRINGS (MANJHA) OR COLORS ALLOWED", "# holi #dcholi #rapu #aapnegujarati #rangpatang #kitefestival #mcpl", "© ", "2024", " Eventbrite"]},
{"name": "I Got Away - Washington DC", "description": ["20774", "Are you ready to leave behind the old and embrace the new?", "I Got Away, in partnership with the 18th annual McDonald’s Inspiration Celebration Gospel Tour, is coming to encourage you to break free and nourish your spirit! We’re uniting top artists who are revolutionizing gospel music and bringing them to a city near you.", "Join us for this unforgettable night, featuring ", " and other special guests. This one-of-a-kind concert series is about more than getting away, it’s about moving forward.", "VIP seating is also available for purchase ", "The tour will shine a light on McDonald’s continued devotion to Ronald McDonald House Charities® (RMHC®). Throughout the concert series, we appreciate your generosity in donating to support families served by local Ronald McDonald Houses.", "Yes! VIP seating is available for purchase at www.igotawaytour.com", "Yes! If you need specific ADA accommodations, our support team will be able to assist you upon check-in at the venue.", "Yes! Limited tickets are free, so please make sure that you register and bring your printed ticket or digital confirmation code upon arrival.", "It's time to shine a brilliant light on the culture. To tell stories of positivity and pride, advancement and empowerment. Let's focus on the people and places that are the greatest expressions of black excellence. Let's share the golden moments that make us smile. Join in and follow ", ".", "© ", "2024", " Eventbrite"]},
{"name": "Enhancing Diversity and Inclusivity in Acquisitions", "description": ["Natcher Conference Center", "1:40 PM", " - ", "2:40 PM", " ", "Instructions for Participating in the Matchmaking Session", "This National Institutes of Health (NIH) conference is being held in collaboration with the White House Initiative on Advancing Educational Equity, Excellence, and Economic Opportunity through Historically Black Colleges and Universities (HBCUs) and the Advanced Research Projects Agency for Health (ARPA-H). Please register for only one breakout session after you click on the get tickets tab.", "Early arrival is strongly suggested in order to be cleared through NIH Campus security. Also, please bring a government issued photo ID to gain access to the NIH Campus.", "© ", "2024", " Eventbrite"]},
{"name": "Maryland Deathfest XIX", "description": ["Baltimore", "- Single-day tickets for Power Plant & Market Place (Friday-Sunday)", "- 4-day pass (all venues)", "- Pre-fest (Wednesday)", "- Power Plant & Market Place 3-Day Pass (Friday-Sunday)", "- Rams Head 3-Day Pass (Friday-Sunday)", "- Soundstage 3-Day Pass (Friday-Sunday)", "- All single-day tickets for Rams Head", "- All single-day tickets for Soundstage", "- Thursday only (Power Plant) - Sodom 'Agent Orange' set", "Sodom", "Atheist", "Melechesh", "Midnight", "Morpheus Descends", "Altars", "Crypt Sermon", "Molder", "Total Maniac", "Sodom (performing 'Agent Orange' in its entirety)", "At War", "Broken Hope", "Cenotaph", "Depulsed", "Incinerate", "Internal Suffering", "Kurnugia", "Stabbing", "Chthe'ilist", "Coffins", "Derkéta", "Dread Sovereign", "Esoteric", "Fossilization", "Agalloch", "AHAB", "Arcturus", "Aura Noir", "Defeated Sanity", "Defleshed", "Oppressor", "1349", "Bölzer", "Imperialist", "Noctem", "One Master", "Spectral Wound", "Brodequin", "Kontusion", "Siege Column", "Sissy Spacek", "Triac", "Vermin Womb", "Weekend Nachos", "Avulsed", "Dismember", "Forbidden", "Sacrifice", "Severe Torture", "Skinless", "Soilent Green", "Vomitory", "Deathhammer", "Impure", "Mork", "Perdition Temple", "Spectral Voice ('Sporagmos' set)", "Yellow Eyes", "Beheaded", "Contaminated", "Haemorrhage", "Intestinal Disgorge", "Lack of Interest", "Noisy Neighbors", "Vomi Noir", "Yacøpsæ", "Abbath", "Artificial Brain", "Bloodbath", "Carpathian Forest", "Cryptopsy ('Blasphemy Made Flesh' set)", "Gorguts", "Primordial", "Ripper", "Archgoat", "Daeva", "Grave Miasma", "Mortuary Drape", "Sinmara", "Spirit Possession", "Archagathus", "Blue Holocaust", "Extortion", "Inhume", "Jig-Ai", "Iron Lung", "Necessary Death", "Organ Failure", "© ", "2024", " Eventbrite"]},
{"name": "\"The Patio\" at Dirty Habit", "description": ["Dirty Habit", "DSTRKT Returns to DIRTY HABIT on Sunday, April 28th, meet us on \"THE PATIO.\" ", "Sponsored by Jefferson's Bourbon & Avion Tequila!", "Try one of our signature drinks for the evening:", "- Jefferson Bourbon Old Fashioned", "- Avion Tequila Margarita", "- Jefferson Bourbon Expresso Martini", "- Avion Tequila Old Fashioned", "- Jefferson Bourbon Dominatrix", "Hungry? Bring your appetite and select dishes from Dirty Habit's delicious menu.", "Meet a new friend | see an old friend | try something new!", "Experience a one of a kind vibe, a dope atmosphere with good food, strong drinks and GREAT COMPANY! Gather your crew and reserve a table: have some drinks and sing along to your favorite songs: enjoy a GOOD time with old friends and new ones too; YOU DESERVE IT.", "Admission is FREE with RSVP, tables are available to reserve.", "© ", "2024", " Eventbrite"]},
{"name": "SummerFest w/Eric Bellinger DCVybe Top5 Secret Society Sirius Co Bela Dona", "description": ["Lerner Town Square", "12:15 PM", " - ", "12:40 PM", " ", "Performance ", "Kenny Sway", "1:10 PM", " - ", "1:55 PM", " ", "Performance ", "Secret Society", "2:15 PM", " - ", "3:00 PM", " ", "Performance", "Top5", "3:30 PM", " - ", "4:15 PM", " ", "Headlining Performance ", "ERIC BELLINGER", "4:45 PM", " - ", "5:30 PM", " ", "Performance", "Bela’Dona", "6:00 PM", " - ", "6:45 PM", " ", "Performance ", "Sirius Company", "7:15 PM", " - ", "8:00 PM", " ", "Performance", "DCVybe ", "DMV....", "🔥Catch Grammy nominated singer songwriter ERIC BELLINGER along with an all star lineup of Washington DC's best bands at our 2024 DMV Summer Kickoff Music Fest📛📛", "💥Last year 3,000+ festival goers descended on Lerner Town Square @Tysons ll for our epic 2023 SummerFest culminating in the fulfillment of our initiative to help send a young lady to Spelman College... and we're doing it again‼️", "💥Join dmv festival goers, and guests from around the U.S. for this 1 day Charity event, and smorgasbord of culture, live jazz, funk, go-go, and Rnb", "💥Sunday June 2nd, 12-8pm @ Lerner Town Square", "💥 4th & 43 (Success Vs The Odds) Presents..", "💥The 2024 DMV Summer Kickoff Music Festival", "Featuring…", "Grammy Nominated Singer Songwriter", "ERIC BELLINGER🎤", "DCVybe 🎼🎼", "Secret Society 🎷", "Sirius Company 🎸", "BelaDona🎹", "Top5 🪗", "Kenny Sway 🎙️", "💥Hosted By Sherell Rowe & ASIA (Majic102.3) 🎙️", "Music by", "💥DJ Biggs Spinning classic hip-hop, soul, go-go, funk, rnb 🎼🎼", "💥DJ Soprano Spinning Afro-Soca, Caribbean, Dancehall, Reggae 🎼🎼", "💥DJ TRINI Spinning classic Afro-Soca, Caribbean, Dancehall, Reggae, Hip-hop & Rnb 🎼🎼", "💥Enjoy a host of delicious sangrias, food, fun, live music, artisan displays, top shelf spirits, champagne, hookah, and much much more.", "💥Vendor and sponsorship opportunities available at $250 / $500 / $1000 / $2500 / $5000", "💥If you are one of our many guests coming in from out of town there are (6) hotels 🏨 within walking distance and (3) Parking Garages 🚘 (#1 Directly across the street from the venue at 1800 Tysons Blvd) (#2 at founding farmers at 1750 Tysons Blvd) (#3 at fogo de chow 1775) all within walking distance of the venue as well🔥🔥YOU ARE NOT PERMITTED TO PARK AT TYSONS MALL UNDER ANY CIRCUMSTANCES. YOU WILL BE TICKETED AND TOWED IMMEDIATELY. ", "💥 Don’t want to drive? We got you covered there is a metro station located at the venue as well🚊", "💥Lawn Chairs, Coolers(36qt max), Food, and two (Sealed) bottles of water permitted.", "No other outside drinks will make it past our security checkpoint. This Is a RAIN or SHINE event. Absolutely No Refunds.", "💥Dress code is relaxed attire.", "💥Come celebrate community, and culture with a diverse group of festival goers from the dmv and all over the U.S. for a great cause.", "📛Insane $49 \"limited\" early bd tkts & tables available for this event now", "🔥Yes I said $49💰🔥👀 They wont last at that price.", "Call ", " For More Info…", "Yes ", "No", "Yes 36 quarts or smaller", "T﻿he A-List of Entertainment is the premier destination for the curation of top tier entertainment events for professionals of all ages.", "© ", "2024", " Eventbrite"]},
{"name": "Career Fair: Exclusive Tech Hiring Event-New Tickets Available", "description": ["Online", "We will be hosting a virtual Tech Career Fair with our hiring partners from fast growing startups and Fortune 500 companies in technology in the US/Canada.  There will be a focus on helping companies achieve their diversity and inclusivity initiative with more diverse candidates to their talent pool. Available roles that our hiring companies are looking to fill are of the following:", "Software Engineering", "Product Management", "Data Scientist", "AI/Machine Learning Engineer", "Data Analyst", "UI/UX Design", "Marketing", "Sales", "Complete the Sign-up form ", " or the link below and upload your resume to the system to get your QR code/candidate profile link: ", "Improve your profile while you are waiting for your profile to be approved ", "*", "Completed and approved profiles will then be visible to different companies for each career fair where companies will then select who to send the invitation to attend their career fair with the next steps.", "Follow the instructions in your email invitation from the employers and attend the career fair with your QR code/digital profile link with the hiring companies that you have been assigned to.", "To reserve your spot ", "here to get your company or get your company on the waitlist ", "for the next event and we will reach out to you with more info if we can slot you in.", "© ", "2024", " Eventbrite"]},
{"name": "Understanding Intergenerational Trauma [Free Webinar]", "description": ["Online", "Trauma can be passed down through families, affecting individuals and communities across generations. ", " in this one-hour seminar with a licensed therapist.", "Fine print: ", ". CEUs are not provided. Everyone who registers will receive the webinar recording & resource info 24 hours after the live event. Sponsored by United Way of Central Iowa. Photo by Johann Walter Bantz.", ": Jaymi Dormaier is a Licensed Master Social Worker with 10+ years of experience in the mental health field. In Jaymi's career as a social worker and therapist, she has worked with diverse populations focusing on anxiety, depression, grief, trauma, foster care, adoption, homelessness, and addiction. She is passionate about helping others live a life they love.", "Mindspring Mental Health Alliance is a grass roots, self help, education, support and advocacy organization dedicated to improving the lives of individuals and families impacted by mental health. ", "© ", "2024", " Eventbrite"]},
{"name": "2024 Maryland Sheep & Wool Festival", "description": ["Howard County Fairgrounds", "Welcome to the Eventbrite site for the 2024 Maryland Sheep & Wool Festival, our 51st annual festival! Complete details about the Festival can be found on our website, ", ".", "You can use this site to buy admission tickets, register for a Shepherds Seminar or Family Activity, purchase tickets for the Saturday Night Dinner and Sunday Breakfast Buffet, and make a donation to support the future of the festival. ", "Note: The deadline for ordering catalogs was March 15. There will be a limited number of catalogs available in the T-shirt Building at the Festival while supplies last for a suggested donation of $5.00.", "18 and older:", "Under 18 admitted free!", "Use this site to purchase your eTickets. Please note there is a processing fee for all online sales. There will be separate lanes to have eTickets scanned, which we anticipate will move faster than the lanes for people paying at the gate.", "Looking for registration for Fiber Arts Seminars? Find that at ", ".", "Admission tickets are non-refundable. Unused tickets will be considered a donation to the Festival.", "No refund after May 1st.", "Gates open at 8:30 a.m. Saturday. NO EARLY ADMISSION. \nGates open at 7:00 a.m. Sunday to accommodate Breakfast Buffet attendees.\nVendors open at 8:30 a.m. both days.\nThe Festival closes at 6:00 p.m. on Saturday and 5:00 p.m. on Sunday.", "Cash and checks will be accepted at the gate; the cost there will be $15.00. Exact change is appreciated. There will be a dedicated exact change lane. \n", "Parking is free.", "Not all areas of the Festival will be accessible. The venue mainly serves agricultural events, and has hills and some uneven roads/sidewalks which may not be easy to navigate for physically disabled people. We do not own the venue and strive to ensure accessibility to the best of our abilities. ", "Yes, use the East entrance, please stay in the far right lane, and parking staff will guide you to the right place.", "Sorry, the Howard County Fairgrounds is located in the rural suburbs of Baltimore. No public transportation is available.", "The festival will be held regardless of the weather. Hot or cold, rain or shine, mud or dust, the festival will go on!", "Service animals only. Please leave your pets at home.", "Admission tickets are non-refundable. Unused tickets will be considered a donation to the Festival. Saturday Shepherds Feast and Sunday Breakfast Buffet - no refund after May 1st.", "More sheep and wool than you can imagine -- always the first full weekend in May. At the Maryland Sheep & Wool Festival, discover the beauty of sheep, the warmth of wool and the delicious taste of lamb during a fun-filled weekend celebrating all things sheep, from hoof to handwoven. Featuring over 800 sheep, sheep shows, sheep breeds display, parade of breeds, working sheepdog and sheep shearing demonstrations, sheep to shawl contest, fleece show and sale, workshops and seminars, special activities for kids, cooking demonstrations, food booths, musical entertainment, over 275 vendors… and much, much more!", "© ", "2024", " Eventbrite"]},
{"name": "NASA’s Boeing Starliner Crew Flight Test", "description": ["Online", "NASA’s Boeing Starliner Crew Flight Test (CFT) will help write a new chapter in human spaceflight by launching the first flight of the CST-100 Starliner spacecraft with astronauts to the International Space Station.", "NASA astronauts Butch Wilmore and Suni Williams are assigned to fly Starliner and United Launch Alliance Atlas V rocket to the International Space Station. The duo will remain docked at the orbiting laboratory for about a week to evaluate the new spacecraft and its systems before returning to Earth in the southwestern United States.", "Registration will provide communications about launch schedule changes, information about launch related activities, and access to curated launch resources.", "Explore the universe and discover our home planet with official NASA events on Eventbrite. Join us as we discover and expand knowledge for the benefit of humanity.", "© ", "2024", " Eventbrite"]},
{"name": "SOUTHERN SOUL GOGO AND R&B CONCERT AND A BIG CAR SHOW", "description": ["Regency Furniture Stadium", "Ray Ramsey, CEO", "© ", "2024", " Eventbrite"]},
{"name": "Poetry & the Creative Mind — a National Poetry Month gala fundraiser", "description": ["Online", "This special celebration in our 90th year features actors, artists, and leaders from across the arts and honors poetry's important place in our society and its impact on the lives of readers.", "Emanuel Ax", "Carrie Coon", "Merve Emre", "Paul Giamatti", "Rebecca Hall", "Miles Hardingwood - National Student Poet", "Sterlin Harjo", "Tony Kushner", "Glenn Ligon", "Phillipa Soo", "Corey Stoll", "Meryl Streep", "Rev. Adriene Thorne", "Courtney B. Vance", "J Wortham", "Suggested donation: $59", "Poetry & the Creative Mind raises funds in support of the Academy of American Poets education programs, which serve over 100,000 K–12 students each year. ", "Donors at the $500 and above receive special benefits as part of the Producers Circle. To learn more, as well as corporate sponsorship opportunities, visit the ", ".", "Your generous contribution is a tax-deductible investment in the programs and publications of the Academy of American Poets, a recognized 501(c)(3) nonprofit.", "This reading will be broadcast as a live event on YouTube. Your registration through Eventbrite includes access to the livestream on April 30. A link will be emailed to you at the address with which you register.", ". Captioning will be available for viewers of the YouTube livestream. If you have any questions or requests related to access, please email giving@poets.org or call (888)790-0721.", "This presentation will be offered only once as a live broadcast event and will not be available for replay. ", "Poems are not screened for appropriateness for school-aged children and viewer discretion is advised.\n", "Approximately 90 minutes.", "Streaming devices or Smart TVs with the YouTube app installed will be able to access the live event stream. \nSearch for \"Poetry and the Creative Mind\" after Monday, April 29.", "academy@poets.org", "© ", "2024", " Eventbrite"]},
{"name": "Measuring Development 2024 | AI, the Next Generation (Virtual)", "description": ["Online", "9:00 AM", " - ", "9:15 AM", " ", "Welcome to MeasureDev 2024", "Carson Christiano", "Ariana Legovini", "Emily Cupito", "9:15 AM", " - ", "9:45 AM", " ", "Keynote I | AI for People Living in Poverty: Opportunities and Challenges", "Dan Björkegren, Columbia University", "9:45 AM", " - ", "10:25 AM", " ", "Tools Demo I | (Semi-)Automated Evidence Aggregation", "Samuel Fraiberger", "Jahnavi Meher", "Aivin Solario", "Dunstan Matekenya", "10:25 AM", " - ", "10:45 AM", " ", "Coffee", "10:45 AM", " - ", "11:45 AM", " ", "Research Session I | Integrating Generative AI into the Scientific Process", "Benjamin Manning", "Sveta Milusheva", "Hamed Alemohammad", "Vivek Sakhrani", "11:45 AM", " - ", "12:30 PM", " ", "Lunch", "12:30 PM", " - ", "1:00 PM", " ", "Keynote II | Guardrails for the New Frontier in Global Development", "Uyi Stewart, Data.org", "1:00 PM", " - ", "1:50 PM", " ", "Panel | Unlocking AI's Economic Potential for Shared Prosperity", "1:55 PM", " - ", "2:50 PM", " ", "Research Session II | AI-Informed Safety and Algorithmic Bias", "Carina Ines Hausladen", "Sung Hyun (SK) Kwon", "Daniel Nkemelu", "Philipp Zimmer", "2:50 PM", " - ", "3:05 PM", " ", "Lightning Talks | Transparency and Accountability in AI Design ", "Narcisse Mbunzama Lokwa", "Katie Wetstone", "Taylor Lynn Curtis", "3:05 PM", " - ", "3:20 PM", " ", "Coffee ", "3:20 PM", " - ", "4:20 PM", " ", "Research Session III | LLM-enabled Behavioral Insights", "Hong-Yi TuYea", "Rem Koning", "Paloma Bellatin", "Brian Jabarian", "4:20 PM", " - ", "4:35 PM", " ", "Lightning Talks | Reasoning with LLMs", "Romain Lacombe", "Julian Ashwin", "Rweyemamu  Barongo", "4:35 PM", " - ", "5:25 PM", " ", "Tools Demo II | Structuring, Verifying, and Extending LLM-informed Research", "5:25 PM", " - ", "5:30 PM", " ", "Closing and Acknowledgements", "Sean Luna McAdams", "Maria Ruth Jones", "Foundational models like large language models (LLMs) have recently commanded widespread public attention—and caution—given their transformational potential for both our economy and society. Naturally, questions loom about how these AI innovations will impact the global development research and policy landscape. If used properly by the right actors, these tools might unlock enormous troves of data and create new opportunities to improve lives around the world.", "The World Bank, the Center for Effective Global Action (CEGA), and the University of Chicago Center for the Economics of Innovation and Development (CEID) are excited to explore this topic at our tenth annual Measuring Development (MeasureDev) Conference, “AI, The Next Generation.” The conference will feature presentations on AI that span the measurement ecosystem: from efforts to improve and expand responsible data infrastructure in low- and middle-income countries (LMICs) and facilitate the development of a new generation of AI tools, to analysis tailoring foundational models to optimize generative AI (GenAI) including LLMs for social impact. The event will feature policymakers from different contexts who are shaping the way these new tools will be adopted and regulated.", "If you would like to attend the event in person at the World Bank in Washington, D.C please click ", " to confirm your attendance. Please note space is limited, so only RSVP if you can cover the costs of attending in Washington, D.C. Thanks for helping us keep an accurate headcount for in-person attendees!", "See summary agenda above. Consult the full agenda ", ".", "© ", "2024", " Eventbrite"]},
{"name": "Tech Career Fair: Exclusive Tech Hiring Event (New slots available)", "description": ["Online", " ", "We will be hosting a Tech Career Fair for hiring companies from fast growing startups to Fortune 500 companies in technology. There will be a focus on helping companies achieve their diversity and inclusivity initiative with more diverse candidates from non-traditional backgrounds (bootcamps/self-taught/non-degree/veterans etc) or experienced professionals who are transitioning careers to their talent pool. With over thousands of candidates already signed up, our partners from ", " will help implement a system to help facilitate narrowing down the right candidates. Companies will also be able to easily add candidates into their pipeline with the recommended diversity candidates identified from the algorithm .", "Roles that our diverse candidates are looking for are of the following:", "Software Engineering", "Product Management", "Data Scientist", "AI/Machine Learning Engineer", "Data Analyst", "UI/UX Design", "Marketing", "Sales", "Available  Packages:", "★★★ Platinum ★★★ $999 :", "✔️ Participate at the career fair", "✔️ Brand/Logo on marketing material", "✔️ Opportunity to give a talk or workshop*", "✔️ Company Name/Job Listings featured in email announcements", "★★ Gold ★★ $699 :", "✔️ Participate at the career fair", "✔️ Brand/Logo on marketing material", "★ Silver ★ $499  :", "✔️ Participate at the career fair", "As a bonus, all  participating companies at the career fair will be given a 50% off the first hire from Careers Crossroad’s platform. Email hello@careerscrossroad.com for more details.", "Come participate and be known for one of the companies that supports diversity and inclusivity. If we are unable to secure a spot for you, you will have the option for a full refund or put you on the next-in-line priority list for the next event. Can't make it to this event/sold out but interested in a future one? Sign up for a waitlist ticket ", "to get on the waitlist and get notified for an open slot in our future events. Thank you for supporting!", "If you purchased a ticket, make sure to look out for your confirmation email regarding the details. It might take a while to process your confirmation to secure a slot for you. If you have not received one, your request might might still be under process/in queue from the backlogged of waitlist companies. If you are unsure or have questions, please email  hello@careerscrossroad.com", "© ", "2024", " Eventbrite"]},
{"name": "Measuring Development 2024 | AI, the Next Generation (In Person)", "description": ["1850 I St NW", "8:30 AM", " - ", "9:00 AM", " ", "Breakfast & networking", "9:00 AM", " - ", "9:15 AM", " ", "Welcome to MeasureDev 2024", "Carson Christiano", "Ariana Legovini", "Emily Cupito", "9:15 AM", " - ", "9:45 AM", " ", "Keynote I | AI for People Living in Poverty: Opportunities and Challenges", "Dan Björkegren, Columbia University", "9:45 AM", " - ", "10:25 AM", " ", "Tools Demo I | (Semi-)Automated Evidence Aggregation", "Samuel Fraiberger", "Jahnavi Meher", "Aivin Solario", "Dunstan Matekenya", "10:25 AM", " - ", "10:45 AM", " ", "Coffee", "10:45 AM", " - ", "11:45 AM", " ", "Research Session I | Integrating Generative AI into the Scientific Process", "Benjamin Manning", "Sveta Milusheva", "Hamed Alemohammad", "Vivek Sakhrani", "11:45 AM", " - ", "12:30 PM", " ", "Lunch", "12:30 PM", " - ", "1:00 PM", " ", "Keynote II | Guardrails for the New Frontier in Global Development", "Uyi Stewart, Data.org", "1:00 PM", " - ", "1:50 PM", " ", "Panel | Unlocking AI's Economic Potential for Shared Prosperity", "1:55 PM", " - ", "2:50 PM", " ", "Research Session II | AI-Informed Safety and Algorithmic Bias", "Carina Ines Hausladen", "Sung Hyun (SK) Kwon", "Daniel Nkemelu", "Philipp Zimmer", "2:50 PM", " - ", "3:05 PM", " ", "Lightning Talks | Transparency and Accountability in AI Design", "Narcisse Mbunzama Lokwa", "Katie Wetstone", "Taylor Lynn Curtis", "3:05 PM", " - ", "3:20 PM", " ", "Coffee", "3:20 PM", " - ", "4:20 PM", " ", "Research Session III | LLM-enabled Behavioral Insights", "Hong-Yi TuYea", "Rem Koning", "Paloma Bellatin", "Brian Jabarian", "4:25 PM", " - ", "4:35 PM", " ", "Lightning Talks | Reasoning with LLMs", "Romain Lacombe", "Julian Ashwin", "Rweyemamu  Barongo", "4:35 PM", " - ", "5:25 PM", " ", "Tools Demo II | Structuring, Verifying, and Extending LLM-informed Research", "5:25 PM", " - ", "5:30 PM", " ", "Closing and Acknowledgements", "Sean Luna McAdams", "Maria Ruth Jones", "5:30 PM", " - ", "7:00 PM", " ", "Hors d’Oeuvres and Refreshments", "Foundational models like large language models (LLMs) have recently commanded widespread public attention—and caution—given their transformational potential for both our economy and society. Naturally, questions loom about how these AI innovations will impact the global development research and policy landscape. If used properly by the right actors, these tools might unlock enormous troves of data and create new opportunities to improve lives around the world.", "The World Bank, the Center for Effective Global Action (CEGA), and the University of Chicago Center for the Economics of Innovation and Development (CEID) are excited to explore this topic at our tenth annual Measuring Development (MeasureDev) Conference, “AI, The Next Generation.” The conference will feature presentations on AI that span the measurement ecosystem: from efforts to improve and expand responsible data infrastructure in low- and middle-income countries (LMICs) and facilitate the development of a new generation of AI tools, to analysis tailoring foundational models to optimize generative AI (GenAI) including LLMs for social impact. The event will feature policymakers from different contexts who are shaping the way these new tools will be adopted and regulated.", "If you would like to attend the event virtually please click ", " to RSVP for virtual attendance. Thanks for helping us keep an accurate headcount for in-person attendees!", "See summary agenda above. Consult the full agenda ", ".", "© ", "2024", " Eventbrite"]},
{"name": "Measuring Development 2024 | AI, the Next Generation (Virtual)", "description": ["Online", "9:00 AM", " - ", "9:15 AM", " ", "Welcome to MeasureDev 2024", "Carson Christiano", "Ariana Legovini", "Emily Cupito", "9:15 AM", " - ", "9:45 AM", " ", "Keynote I | AI for People Living in Poverty: Opportunities and Challenges", "Dan Björkegren, Columbia University", "9:45 AM", " - ", "10:25 AM", " ", "Tools Demo I | (Semi-)Automated Evidence Aggregation", "Samuel Fraiberger", "Jahnavi Meher", "Aivin Solario", "Dunstan Matekenya", "10:25 AM", " - ", "10:45 AM", " ", "Coffee", "10:45 AM", " - ", "11:45 AM", " ", "Research Session I | Integrating Generative AI into the Scientific Process", "Benjamin Manning", "Sveta Milusheva", "Hamed Alemohammad", "Vivek Sakhrani", "11:45 AM", " - ", "12:30 PM", " ", "Lunch", "12:30 PM", " - ", "1:00 PM", " ", "Keynote II | Guardrails for the New Frontier in Global Development", "Uyi Stewart, Data.org", "1:00 PM", " - ", "1:50 PM", " ", "Panel | Unlocking AI's Economic Potential for Shared Prosperity", "1:55 PM", " - ", "2:50 PM", " ", "Research Session II | AI-Informed Safety and Algorithmic Bias", "Carina Ines Hausladen", "Sung Hyun (SK) Kwon", "Daniel Nkemelu", "Philipp Zimmer", "2:50 PM", " - ", "3:05 PM", " ", "Lightning Talks | Transparency and Accountability in AI Design ", "Narcisse Mbunzama Lokwa", "Katie Wetstone", "Taylor Lynn Curtis", "3:05 PM", " - ", "3:20 PM", " ", "Coffee ", "3:20 PM", " - ", "4:20 PM", " ", "Research Session III | LLM-enabled Behavioral Insights", "Hong-Yi TuYea", "Rem Koning", "Paloma Bellatin", "Brian Jabarian", "4:20 PM", " - ", "4:35 PM", " ", "Lightning Talks | Reasoning with LLMs", "Romain Lacombe", "Julian Ashwin", "Rweyemamu  Barongo", "4:35 PM", " - ", "5:25 PM", " ", "Tools Demo II | Structuring, Verifying, and Extending LLM-informed Research", "5:25 PM", " - ", "5:30 PM", " ", "Closing and Acknowledgements", "Sean Luna McAdams", "Maria Ruth Jones", "Foundational models like large language models (LLMs) have recently commanded widespread public attention—and caution—given their transformational potential for both our economy and society. Naturally, questions loom about how these AI innovations will impact the global development research and policy landscape. If used properly by the right actors, these tools might unlock enormous troves of data and create new opportunities to improve lives around the world.", "The World Bank, the Center for Effective Global Action (CEGA), and the University of Chicago Center for the Economics of Innovation and Development (CEID) are excited to explore this topic at our tenth annual Measuring Development (MeasureDev) Conference, “AI, The Next Generation.” The conference will feature presentations on AI that span the measurement ecosystem: from efforts to improve and expand responsible data infrastructure in low- and middle-income countries (LMICs) and facilitate the development of a new generation of AI tools, to analysis tailoring foundational models to optimize generative AI (GenAI) including LLMs for social impact. The event will feature policymakers from different contexts who are shaping the way these new tools will be adopted and regulated.", "If you would like to attend the event in person at the World Bank in Washington, D.C please click ", " to confirm your attendance. Please note space is limited, so only RSVP if you can cover the costs of attending in Washington, D.C. Thanks for helping us keep an accurate headcount for in-person attendees!", "See summary agenda above. Consult the full agenda ", ".", "© ", "2024", " Eventbrite"]}
][
{"name": "Enhancing Diversity and Inclusivity in Acquisitions", "link": "https://www.eventbrite.com/e/enhancing-diversity-and-inclusivity-in-acquisitions-tickets-836322973527?aff=ebdssbcitybrowse", "description": "This National Institutes of Health (NIH) conference is being held in collaboration with the White House Initiative on Advancing Educational Equity, Excellence, and Economic Opportunity through Historically Black Colleges and Universities (HBCUs) and the Advanced Research Projects Agency for Health (ARPA-H). Please register for only one breakout session after you click on the get tickets tab."},
{"name": "Maryland Deathfest XIX", "link": "https://www.eventbrite.com/e/maryland-deathfest-xix-tickets-520348395057?aff=ebdssbcitybrowse", "description": ""},
{"name": "\"The Patio\" at Dirty Habit", "link": "https://www.eventbrite.com/e/the-patio-at-dirty-habit-tickets-876325020727?aff=ebdssbcitybrowse", "description": "DSTRKT Returns to DIRTY HABIT on Sunday, April 28th, meet us on \"THE PATIO.\" "},
{"name": "I Got Away - Washington DC", "link": "https://www.eventbrite.com/e/i-got-away-washington-dc-tickets-863121478577?aff=ebdssbcitybrowse", "description": "I Got Away, in partnership with the 18th annual McDonald’s Inspiration Celebration Gospel Tour, is coming to encourage you to break free and nourish your spirit! We’re uniting top artists who are revolutionizing gospel music and bringing them to a city near you."},
{"name": "7th Annual MCPL Rang Aur Patang Utsav 2024", "link": "https://www.eventbrite.com/e/7th-annual-mcpl-rang-aur-patang-utsav-2024-tickets-843556398897?aff=ebdssbcitybrowse", "description": "#RAPU 2024...!!!!"},
{"name": "SOUTHERN SOUL GOGO AND R&B CONCERT AND A BIG CAR SHOW", "link": "https://www.eventbrite.com/e/southern-soul-gogo-and-rb-concert-and-a-big-car-show-tickets-781596826147?aff=ebdssbcitybrowse", "description": ""},
{"name": "SummerFest w/Eric Bellinger DCVybe Top5 Secret Society Sirius Co Bela Dona", "link": "https://www.eventbrite.com/e/summerfest-weric-bellinger-dcvybe-top5-secret-society-sirius-co-bela-dona-tickets-769412101307?aff=ebdssbcitybrowse", "description": "DMV...."},
{"name": "2024 Maryland Sheep & Wool Festival", "link": "https://www.eventbrite.com/e/2024-maryland-sheep-wool-festival-tickets-824512197177?aff=ebdssbcitybrowse", "description": "You can use this site to buy admission tickets, register for a Shepherds Seminar or Family Activity, purchase tickets for the Saturday Night Dinner and Sunday Breakfast Buffet, and make a donation to support the future of the festival. "},
{"name": "Career Fair: Exclusive Tech Hiring Event-New Tickets Available", "link": "https://www.eventbrite.com/e/career-fair-exclusive-tech-hiring-event-new-tickets-available-tickets-63049080497?aff=ebdssbcitybrowse", "description": "We will be hosting a virtual Tech Career Fair with our hiring partners from fast growing startups and Fortune 500 companies in technology in the US/Canada.  There will be a focus on helping companies achieve their diversity and inclusivity initiative with more diverse candidates to their talent pool. Available roles that our hiring companies are looking to fill are of the following:"},
{"name": "NASA’s Boeing Starliner Crew Flight Test", "link": "https://www.eventbrite.com/e/nasas-boeing-starliner-crew-flight-test-registration-523750591117?aff=ebdssbcitybrowse", "description": "NASA’s Boeing Starliner Crew Flight Test (CFT) will help write a new chapter in human spaceflight by launching the first flight of the CST-100 Starliner spacecraft with astronauts to the International Space Station."},
{"name": "Understanding Intergenerational Trauma [Free Webinar]", "link": "https://www.eventbrite.com/e/understanding-intergenerational-trauma-free-webinar-tickets-845016957467?aff=ebdssbcitybrowse", "description": "Trauma can be passed down through families, affecting individuals and communities across generations. "},
{"name": "Measuring Development 2024 | AI, the Next Generation (Virtual)", "link": "https://www.eventbrite.com/e/measuring-development-2024-ai-the-next-generation-virtual-tickets-852312608957?aff=ebdssbcitybrowse", "description": "Uyi Stewart, Data.org"},
{"name": "Poetry & the Creative Mind — a National Poetry Month gala fundraiser", "link": "https://www.eventbrite.com/e/poetry-the-creative-mind-a-national-poetry-month-gala-fundraiser-registration-861695393117?aff=ebdssbcitybrowse", "description": "This special celebration in our 90th year features actors, artists, and leaders from across the arts and honors poetry's important place in our society and its impact on the lives of readers."},
{"name": "Tech Career Fair: Exclusive Tech Hiring Event (New slots available)", "link": "https://www.eventbrite.com/e/tech-career-fair-exclusive-tech-hiring-event-new-slots-available-tickets-146564621729", "description": "We will be hosting a Tech Career Fair for hiring companies from fast growing startups to Fortune 500 companies in technology. There will be a focus on helping companies achieve their diversity and inclusivity initiative with more diverse candidates from non-traditional backgrounds (bootcamps/self-taught/non-degree/veterans etc) or experienced professionals who are transitioning careers to their talent pool. With over thousands of candidates already signed up, our partners from "},
{"name": "Measuring Development 2024 | AI, the Next Generation (In Person)", "link": "https://www.eventbrite.com/e/measuring-development-2024-ai-the-next-generation-in-person-tickets-851883074207?aff=oddtdtcreator", "description": "Uyi Stewart, Data.org"},
{"name": "Measuring Development 2024 | AI, the Next Generation (Virtual)", "link": "https://www.eventbrite.com/e/measuring-development-2024-ai-the-next-generation-virtual-tickets-852312608957?aff=oddtdtcreator", "description": "Uyi Stewart, Data.org"}
]